#include <NanitLib.h>
#include <Servo.h>

Servo servo;  // Створення об'єкту "servo" типу Servo для керування сервоприводом.

void setup() {
  Nanit_Base_Start();  // Ініціалізація Nanit.
  servo.attach(P4_4);  // Приєднання сервоприводу до піна P4_4 мікроконтролера.
  servo.write(0);      // Установка початкового положення сервоприводу на 0 градусів.
}

void loop() {        // Головна функція програми, яка повторюється безкінечно після виконання функції setup().
  servo.write(0);    // Поворот сервоприводу на 0 градусів.
  delay(500);        // Затримка 500 мілісекунд.
  servo.write(180);  // Поворот сервоприводу на 180 градусів.
  delay(500);        // Затримка 500 мілісекунд.
}