#include <NanitLib.h>
#include <Servo.h>

Servo servo;  // Створення об'єкту "servo" типу Servo для керування сервоприводом.

void setup() {
  Nanit_Base_Start();  // Ініціалізація платформи Nanit.
  servo.attach(P4_4);  // Приєднання сервоприводу до піна P7_4 мікроконтролера.
  servo.write(0);      // Установка початкового положення сервоприводу на 0 градусів.
}

void loop() {
  int potValue = analogRead(P4_1);            // Зчитування значення з аналогового входу P7_1 і збереження його у змінній "potValue".
  potValue = map(potValue, 0, 1023, 0, 180);  // Перетворення значення "potValue" з діапазону[0, 1023] на діапазон[0, 180].
  servo.write(potValue);                      // Встановлення положення сервоприводу відповідно до перетвореного значення "potValue".
  delay(500);                                 // Затримка 500 мілісекунд.
}