#include <NanitLib.h>

int button = P3_3; // Встановлюємо P3_3 як пін для кнопки.
// з внутрьошнім резиистором
void setup() { // Функція setup виконується один раз при запуску програми.
  Nanit_Base_Start(); // Ініціалізація Nanit. Ця функція необхідна для запуску роботи з Nanit.
  pinMode(button, INPUT_PULLUP); // Встановлюємо пін кнопки як вхідний з внутрішнім підтягуванням.
  Serial.begin(9600); // Відкриваємо серійний порт для комунікації зі швидкістю 9600 бод.
}

void loop() { // Головна функція програми, яка повторюється безкінечно після виконання функції setup().
  Serial.println(digitalRead(button)); // Зчитуємо стан піна кнопки і виводимо його на серійний порт.
  delay(100); // Затримка 100 мілісекунд між циклами loop().
}